{"class_name": "Functional", "config": {"name": "model_6", "trainable": true, "layers": [{"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 28, 28], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_7"}, "registered_name": null, "name": "input_7", "inbound_nodes": []}, {"module": "HGQ.proxy.fixed_point_quantizer", "class_name": "FixedPointQuantizer", "config": {"name": "h_quantize_quantizer", "trainable": false, "dtype": "float32", "RND": "RND", "SAT": "WRAP", "shape": [1, 1, 28], "overrides": {"layers": {"input_7": {"result_t": "ufixed<4,2,TRN,WRAP>"}, "h_quantize_quantizer": {"result_t": "ufixed<3,2,TRN,WRAP>"}}}, "fusible": false}, "registered_name": "FixedPointQuantizer", "build_config": {"input_shape": [null, 28, 28]}, "name": "h_quantize_quantizer", "inbound_nodes": [[["input_7", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Reshape", "config": {"name": "p_reshape", "trainable": true, "dtype": "float32", "target_shape": [28, 28, 1]}, "registered_name": null, "build_config": {"input_shape": [null, 28, 28]}, "name": "p_reshape", "inbound_nodes": [[["h_quantize_quantizer", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "h_conv2d", "trainable": true, "dtype": "float32", "filters": 4, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "name": "h_conv2d", "inbound_nodes": [[["p_reshape", 0, 0, {}]]]}, {"module": "HGQ.proxy.fixed_point_quantizer", "class_name": "FixedPointQuantizer", "config": {"name": "h_conv2d_quantizer", "trainable": false, "dtype": "float32", "RND": "TRN", "SAT": "WRAP", "shape": [1], "overrides": {"layers": {"h_conv2d": {"_accum_multiplicity": 9.0, "parallelization_factor": 676, "weight_t": "fixed<5,2>", "accum_t": "fixed<9,5>", "result_t": "fixed<7,5,TRN,WRAP>", "bias_t": "fixed<9,5>"}, "p_reshape": {"result_t": "ufixed<3,2,TRN,WRAP>"}, "h_conv2d_quantizer": {"result_t": "fixed<7,5,TRN,WRAP>"}}}, "fusible": true}, "registered_name": "FixedPointQuantizer", "build_config": {"input_shape": [null, 26, 26, 4]}, "name": "h_conv2d_quantizer", "inbound_nodes": [[["h_conv2d", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "h_conv2d_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "registered_name": null, "build_config": {"input_shape": [null, 26, 26, 4]}, "name": "h_conv2d_relu", "inbound_nodes": [[["h_conv2d_quantizer", 0, 0, {}]]]}, {"module": "HGQ.proxy.fixed_point_quantizer", "class_name": "FixedPointQuantizer", "config": {"name": "h_conv2d_relu_quantizer", "trainable": false, "dtype": "float32", "RND": "TRN", "SAT": "WRAP", "shape": [1, 1, 1, 4], "overrides": {"layers": {"h_conv2d_relu": {"table_t": "ufixed<5,3,TRN,WRAP>", "table_size": 128, "result_t": "ufixed<5,3,TRN,WRAP>"}, "h_conv2d_relu_quantizer": {"result_t": "ufixed<5,3,TRN,WRAP>"}}}, "fusible": false}, "registered_name": "FixedPointQuantizer", "build_config": {"input_shape": [null, 26, 26, 4]}, "name": "h_conv2d_relu_quantizer", "inbound_nodes": [[["h_conv2d_relu", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "MaxPooling2D", "config": {"name": "p_max_pooling2d", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "registered_name": null, "build_config": {"input_shape": [null, 26, 26, 4]}, "name": "p_max_pooling2d", "inbound_nodes": [[["h_conv2d_relu_quantizer", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "h_conv2d_1", "trainable": true, "dtype": "float32", "filters": 4, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "name": "h_conv2d_1", "inbound_nodes": [[["p_max_pooling2d", 0, 0, {}]]]}, {"module": "HGQ.proxy.fixed_point_quantizer", "class_name": "FixedPointQuantizer", "config": {"name": "h_conv2d_1_quantizer", "trainable": false, "dtype": "float32", "RND": "TRN", "SAT": "WRAP", "shape": [1], "overrides": {"layers": {"h_conv2d_1": {"_accum_multiplicity": 36.0, "parallelization_factor": 121, "weight_t": "fixed<6,2>", "accum_t": "fixed<13,7>", "result_t": "fixed<8,7,TRN,WRAP>", "bias_t": "fixed<13,7>"}, "p_max_pooling2d": {"result_t": "ufixed<5,3,TRN,WRAP>"}, "h_conv2d_1_quantizer": {"result_t": "fixed<8,7,TRN,WRAP>"}}}, "fusible": true}, "registered_name": "FixedPointQuantizer", "build_config": {"input_shape": [null, 11, 11, 4]}, "name": "h_conv2d_1_quantizer", "inbound_nodes": [[["h_conv2d_1", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "h_conv2d_1_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "registered_name": null, "build_config": {"input_shape": [null, 11, 11, 4]}, "name": "h_conv2d_1_relu", "inbound_nodes": [[["h_conv2d_1_quantizer", 0, 0, {}]]]}, {"module": "HGQ.proxy.fixed_point_quantizer", "class_name": "FixedPointQuantizer", "config": {"name": "h_conv2d_1_relu_quantizer", "trainable": false, "dtype": "float32", "RND": "TRN", "SAT": "WRAP", "shape": [1, 1, 1, 4], "overrides": {"layers": {"h_conv2d_1_relu": {"table_t": "ufixed<5,4,TRN,WRAP>", "table_size": 256, "result_t": "ufixed<5,4,TRN,WRAP>"}, "h_conv2d_1_relu_quantizer": {"result_t": "ufixed<5,4,TRN,WRAP>"}}}, "fusible": false}, "registered_name": "FixedPointQuantizer", "build_config": {"input_shape": [null, 11, 11, 4]}, "name": "h_conv2d_1_relu_quantizer", "inbound_nodes": [[["h_conv2d_1_relu", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "MaxPooling2D", "config": {"name": "p_max_pooling2d_1", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "registered_name": null, "build_config": {"input_shape": [null, 11, 11, 4]}, "name": "p_max_pooling2d_1", "inbound_nodes": [[["h_conv2d_1_relu_quantizer", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Flatten", "config": {"name": "p_flatten", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "registered_name": null, "build_config": {"input_shape": [null, 5, 5, 4]}, "name": "p_flatten", "inbound_nodes": [[["p_max_pooling2d_1", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "h_dense", "trainable": true, "dtype": "float32", "units": 32, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "name": "h_dense", "inbound_nodes": [[["p_flatten", 0, 0, {}]]]}, {"module": "HGQ.proxy.fixed_point_quantizer", "class_name": "FixedPointQuantizer", "config": {"name": "h_dense_quantizer", "trainable": false, "dtype": "float32", "RND": "TRN", "SAT": "WRAP", "shape": [1], "overrides": {"layers": {"h_dense": {"_accum_multiplicity": 100.0, "weight_t": "fixed<8,3>", "accum_t": "fixed<13,7>", "result_t": "fixed<6,7,TRN,WRAP>", "bias_t": "fixed<13,7>"}, "p_max_pooling2d_1": {"result_t": "ufixed<5,4,TRN,WRAP>"}, "p_flatten": {"result_t": "ufixed<5,4,TRN,WRAP>"}, "h_dense_quantizer": {"result_t": "fixed<6,7,TRN,WRAP>"}}}, "fusible": true}, "registered_name": "FixedPointQuantizer", "build_config": {"input_shape": [null, 32]}, "name": "h_dense_quantizer", "inbound_nodes": [[["h_dense", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "h_dense_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "registered_name": null, "build_config": {"input_shape": [null, 32]}, "name": "h_dense_relu", "inbound_nodes": [[["h_dense_quantizer", 0, 0, {}]]]}, {"module": "HGQ.proxy.fixed_point_quantizer", "class_name": "FixedPointQuantizer", "config": {"name": "h_dense_relu_quantizer", "trainable": false, "dtype": "float32", "RND": "TRN", "SAT": "WRAP", "shape": [1, 32], "overrides": {"layers": {"h_dense_relu": {"table_t": "ufixed<5,6,TRN,WRAP>", "table_size": 64, "result_t": "ufixed<5,6,TRN,WRAP>"}, "h_dense_relu_quantizer": {"result_t": "ufixed<6,6,TRN,WRAP>"}}}, "fusible": false}, "registered_name": "FixedPointQuantizer", "build_config": {"input_shape": [null, 32]}, "name": "h_dense_relu_quantizer", "inbound_nodes": [[["h_dense_relu", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "h_dense_1", "trainable": true, "dtype": "float32", "units": 10, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "name": "h_dense_1", "inbound_nodes": [[["h_dense_relu_quantizer", 0, 0, {}]]]}, {"module": "HGQ.proxy.fixed_point_quantizer", "class_name": "FixedPointQuantizer", "config": {"name": "h_dense_1_quantizer", "trainable": false, "dtype": "float32", "RND": "TRN", "SAT": "WRAP", "shape": [1, 10], "overrides": {"layers": {"h_dense_1": {"_accum_multiplicity": 32.0, "weight_t": "fixed<9,2>", "accum_t": "fixed<14,7>", "result_t": "fixed<10,7,TRN,WRAP>", "bias_t": "fixed<14,7>"}, "h_dense_1_quantizer": {"result_t": "fixed<10,7,TRN,WRAP>"}}}, "fusible": false}, "registered_name": "FixedPointQuantizer", "build_config": {"input_shape": [null, 10]}, "name": "h_dense_1_quantizer", "inbound_nodes": [[["h_dense_1", 0, 0, {}]]]}], "input_layers": [["input_7", 0, 0]], "output_layers": [["h_dense_1_quantizer", 0, 0]]}, "keras_version": "2.13.1", "backend": "tensorflow"}
