{"class_name": "Functional", "config": {"name": "model_7", "trainable": true, "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 28, 28], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_8"}, "name": "input_8", "inbound_nodes": []}, {"class_name": "FixedPointQuantizer", "config": {"name": "h_quantize_1_quantizer", "trainable": false, "dtype": "float32", "RND": "RND", "SAT": "WRAP", "shape": [1, 1, 1], "overrides": {"layers": {"input_8": {"result_t": "ufixed<5,1,RND,WRAP>"}, "h_quantize_1_quantizer": {"result_t": "ufixed<5,1,TRN,WRAP>"}}}, "fusible": true}, "name": "h_quantize_1_quantizer", "inbound_nodes": [[["input_8", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "p_reshape_1", "trainable": true, "dtype": "float32", "target_shape": [28, 28, 1]}, "name": "p_reshape_1", "inbound_nodes": [[["h_quantize_1_quantizer", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "h_conv2d_2", "trainable": true, "dtype": "float32", "filters": 4, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "h_conv2d_2", "inbound_nodes": [[["p_reshape_1", 0, 0, {}]]]}, {"class_name": "FixedPointQuantizer", "config": {"name": "h_conv2d_2_quantizer", "trainable": false, "dtype": "float32", "RND": "TRN", "SAT": "WRAP", "shape": [1], "overrides": {"layers": {"h_conv2d_2": {"_accum_multiplicity": 9.0, "parallelization_factor": 1, "weight_t": "fixed<4,1>", "accum_t": "fixed<10,3>", "result_t": "fixed<7,3,TRN,WRAP>", "bias_t": "fixed<10,3>"}, "p_reshape_1": {"result_t": "ufixed<5,1,TRN,WRAP>"}, "h_conv2d_2_quantizer": {"result_t": "fixed<7,3,TRN,WRAP>"}}}, "fusible": true}, "name": "h_conv2d_2_quantizer", "inbound_nodes": [[["h_conv2d_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "h_conv2d_2_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "h_conv2d_2_relu", "inbound_nodes": [[["h_conv2d_2_quantizer", 0, 0, {}]]]}, {"class_name": "FixedPointQuantizer", "config": {"name": "h_conv2d_2_relu_quantizer", "trainable": false, "dtype": "float32", "RND": "TRN", "SAT": "WRAP", "shape": [1, 1, 1, 1], "overrides": {"layers": {"h_conv2d_2_relu": {"table_t": "ufixed<6,2,TRN,WRAP>", "table_size": 128, "result_t": "ufixed<6,2,TRN,WRAP>"}, "h_conv2d_2_relu_quantizer": {"result_t": "ufixed<6,2,TRN,WRAP>"}}}, "fusible": true}, "name": "h_conv2d_2_relu_quantizer", "inbound_nodes": [[["h_conv2d_2_relu", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "p_max_pooling2d_2", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "p_max_pooling2d_2", "inbound_nodes": [[["h_conv2d_2_relu_quantizer", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "h_conv2d_3", "trainable": true, "dtype": "float32", "filters": 4, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "h_conv2d_3", "inbound_nodes": [[["p_max_pooling2d_2", 0, 0, {}]]]}, {"class_name": "FixedPointQuantizer", "config": {"name": "h_conv2d_3_quantizer", "trainable": false, "dtype": "float32", "RND": "TRN", "SAT": "WRAP", "shape": [1], "overrides": {"layers": {"h_conv2d_3": {"_accum_multiplicity": 36.0, "parallelization_factor": 1, "weight_t": "fixed<5,2>", "accum_t": "fixed<12,5>", "result_t": "fixed<7,5,TRN,WRAP>", "bias_t": "fixed<12,5>"}, "p_max_pooling2d_2": {"result_t": "ufixed<6,2,TRN,WRAP>"}, "h_conv2d_3_quantizer": {"result_t": "fixed<7,5,TRN,WRAP>"}}}, "fusible": true}, "name": "h_conv2d_3_quantizer", "inbound_nodes": [[["h_conv2d_3", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "h_conv2d_3_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "h_conv2d_3_relu", "inbound_nodes": [[["h_conv2d_3_quantizer", 0, 0, {}]]]}, {"class_name": "FixedPointQuantizer", "config": {"name": "h_conv2d_3_relu_quantizer", "trainable": false, "dtype": "float32", "RND": "TRN", "SAT": "WRAP", "shape": [1, 1, 1, 1], "overrides": {"layers": {"h_conv2d_3_relu": {"table_t": "ufixed<4,2,TRN,WRAP>", "table_size": 128, "result_t": "ufixed<4,2,TRN,WRAP>"}, "h_conv2d_3_relu_quantizer": {"result_t": "ufixed<4,2,TRN,WRAP>"}}}, "fusible": true}, "name": "h_conv2d_3_relu_quantizer", "inbound_nodes": [[["h_conv2d_3_relu", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "p_max_pooling2d_3", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "p_max_pooling2d_3", "inbound_nodes": [[["h_conv2d_3_relu_quantizer", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "p_flatten_1", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "p_flatten_1", "inbound_nodes": [[["p_max_pooling2d_3", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "h_dense_2", "trainable": true, "dtype": "float32", "units": 32, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "h_dense_2", "inbound_nodes": [[["p_flatten_1", 0, 0, {}]]]}, {"class_name": "FixedPointQuantizer", "config": {"name": "h_dense_2_quantizer", "trainable": false, "dtype": "float32", "RND": "TRN", "SAT": "WRAP", "shape": [1], "overrides": {"layers": {"h_dense_2": {"_accum_multiplicity": 100.0, "weight_t": "fixed<6,3>", "accum_t": "fixed<12,7>", "result_t": "fixed<8,7,TRN,WRAP>", "bias_t": "fixed<12,7>"}, "p_max_pooling2d_3": {"result_t": "ufixed<4,2,TRN,WRAP>"}, "p_flatten_1": {"result_t": "ufixed<4,2,TRN,WRAP>"}, "h_dense_2_quantizer": {"result_t": "fixed<8,7,TRN,WRAP>"}}}, "fusible": true}, "name": "h_dense_2_quantizer", "inbound_nodes": [[["h_dense_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "h_dense_2_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "h_dense_2_relu", "inbound_nodes": [[["h_dense_2_quantizer", 0, 0, {}]]]}, {"class_name": "FixedPointQuantizer", "config": {"name": "h_dense_2_relu_quantizer", "trainable": false, "dtype": "float32", "RND": "TRN", "SAT": "WRAP", "shape": [1, 1], "overrides": {"layers": {"h_dense_2_relu": {"table_t": "ufixed<6,5,TRN,WRAP>", "table_size": 256, "result_t": "ufixed<6,5,TRN,WRAP>"}, "h_dense_2_relu_quantizer": {"result_t": "ufixed<6,5,TRN,WRAP>"}}}, "fusible": true}, "name": "h_dense_2_relu_quantizer", "inbound_nodes": [[["h_dense_2_relu", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "h_dense_3", "trainable": true, "dtype": "float32", "units": 10, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "h_dense_3", "inbound_nodes": [[["h_dense_2_relu_quantizer", 0, 0, {}]]]}, {"class_name": "FixedPointQuantizer", "config": {"name": "h_dense_3_quantizer", "trainable": false, "dtype": "float32", "RND": "TRN", "SAT": "WRAP", "shape": [1, 1], "overrides": {"layers": {"h_dense_3": {"_accum_multiplicity": 32.0, "weight_t": "fixed<6,3>", "accum_t": "fixed<11,7>", "result_t": "fixed<10,7,TRN,WRAP>", "bias_t": "fixed<11,7>"}, "h_dense_3_quantizer": {"result_t": "fixed<10,7,TRN,WRAP>"}}}, "fusible": true}, "name": "h_dense_3_quantizer", "inbound_nodes": [[["h_dense_3", 0, 0, {}]]]}], "input_layers": [["input_8", 0, 0]], "output_layers": [["h_dense_3_quantizer", 0, 0]]}, "keras_version": "2.13.1", "backend": "tensorflow"}
