{"class_name":"Functional","config":{"name":"model","trainable":true,"layers":[{"module":"keras.layers","class_name":"InputLayer","config":{"batch_input_shape":[null,16],"dtype":"float32","sparse":false,"ragged":false,"name":"input_1"},"registered_name":null,"name":"input_1","inbound_nodes":[]},{"module":"hls4ml.utils.fixed_point_quantizer","class_name":"FixedPointQuantizer","config":{"name":"inp_q_quantizer","trainable":false,"dtype":"float32","RND":"TRN","SAT":"WRAP","shape":[1,16],"overrides":{"layers":{"input_1":{"result_t":"fixed<12,5,TRN,WRAP>"},"inp_q_quantizer":{"result_t":"fixed<12,5,TRN,WRAP>"}}},"fusible":false},"registered_name":"FixedPointQuantizer","build_config":{"input_shape":[null,16]},"name":"inp_q_quantizer","inbound_nodes":[[["input_1",0,0,{}]]]},{"module":"keras.layers","class_name":"Dense","config":{"name":"dense_1","trainable":true,"dtype":"float32","units":64,"activation":"linear","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,16]},"name":"dense_1","inbound_nodes":[[["inp_q_quantizer",0,0,{}]]]},{"module":"hls4ml.utils.fixed_point_quantizer","class_name":"FixedPointQuantizer","config":{"name":"dense_1_quantizer","trainable":false,"dtype":"float32","RND":"TRN","SAT":"WRAP","shape":[1],"overrides":{"layers":{"dense_1":{"_accum_multiplicity":16.0,"weight_t":"fixed<10,5>","accum_t":"fixed<21,9>","result_t":"fixed<12,9,TRN,WRAP>","bias_t":"fixed<21,9>"},"dense_1_quantizer":{"result_t":"fixed<12,9,TRN,WRAP>"}}},"fusible":true},"registered_name":"FixedPointQuantizer","build_config":{"input_shape":[null,64]},"name":"dense_1_quantizer","inbound_nodes":[[["dense_1",0,0,{}]]]},{"module":"keras.layers","class_name":"Activation","config":{"name":"dense_1_relu","trainable":true,"dtype":"float32","activation":"relu"},"registered_name":null,"build_config":{"input_shape":[null,64]},"name":"dense_1_relu","inbound_nodes":[[["dense_1_quantizer",0,0,{}]]]},{"module":"hls4ml.utils.fixed_point_quantizer","class_name":"FixedPointQuantizer","config":{"name":"dense_1_relu_quantizer","trainable":false,"dtype":"float32","RND":"TRN","SAT":"WRAP","shape":[1,64],"overrides":{"layers":{"dense_1_relu":{"table_t":"ufixed<11,8,TRN,WRAP>","table_size":4096,"result_t":"ufixed<11,8,TRN,WRAP>"},"dense_1_relu_quantizer":{"result_t":"ufixed<11,8,TRN,WRAP>"}}},"fusible":false},"registered_name":"FixedPointQuantizer","build_config":{"input_shape":[null,64]},"name":"dense_1_relu_quantizer","inbound_nodes":[[["dense_1_relu",0,0,{}]]]},{"module":"keras.layers","class_name":"Dense","config":{"name":"dense_2","trainable":true,"dtype":"float32","units":32,"activation":"linear","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,64]},"name":"dense_2","inbound_nodes":[[["dense_1_relu_quantizer",0,0,{}]]]},{"module":"hls4ml.utils.fixed_point_quantizer","class_name":"FixedPointQuantizer","config":{"name":"dense_2_quantizer","trainable":false,"dtype":"float32","RND":"TRN","SAT":"WRAP","shape":[1],"overrides":{"layers":{"dense_2":{"_accum_multiplicity":64.0,"weight_t":"fixed<9,4>","accum_t":"fixed<19,11>","result_t":"fixed<12,11,TRN,WRAP>","bias_t":"fixed<19,11>"},"dense_2_quantizer":{"result_t":"fixed<12,11,TRN,WRAP>"}}},"fusible":true},"registered_name":"FixedPointQuantizer","build_config":{"input_shape":[null,32]},"name":"dense_2_quantizer","inbound_nodes":[[["dense_2",0,0,{}]]]},{"module":"keras.layers","class_name":"Activation","config":{"name":"dense_2_relu","trainable":true,"dtype":"float32","activation":"relu"},"registered_name":null,"build_config":{"input_shape":[null,32]},"name":"dense_2_relu","inbound_nodes":[[["dense_2_quantizer",0,0,{}]]]},{"module":"hls4ml.utils.fixed_point_quantizer","class_name":"FixedPointQuantizer","config":{"name":"dense_2_relu_quantizer","trainable":false,"dtype":"float32","RND":"TRN","SAT":"WRAP","shape":[1,32],"overrides":{"layers":{"dense_2_relu":{"table_t":"ufixed<8,7,TRN,WRAP>","table_size":4096,"result_t":"ufixed<8,7,TRN,WRAP>"},"dense_2_relu_quantizer":{"result_t":"ufixed<8,7,TRN,WRAP>"}}},"fusible":false},"registered_name":"FixedPointQuantizer","build_config":{"input_shape":[null,32]},"name":"dense_2_relu_quantizer","inbound_nodes":[[["dense_2_relu",0,0,{}]]]},{"module":"keras.layers","class_name":"Dense","config":{"name":"dense_3","trainable":true,"dtype":"float32","units":32,"activation":"linear","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,32]},"name":"dense_3","inbound_nodes":[[["dense_2_relu_quantizer",0,0,{}]]]},{"module":"hls4ml.utils.fixed_point_quantizer","class_name":"FixedPointQuantizer","config":{"name":"dense_3_quantizer","trainable":false,"dtype":"float32","RND":"TRN","SAT":"WRAP","shape":[1],"overrides":{"layers":{"dense_3":{"_accum_multiplicity":32.0,"weight_t":"fixed<11,5>","accum_t":"fixed<19,12>","result_t":"fixed<14,12,TRN,WRAP>","bias_t":"fixed<19,12>"},"dense_3_quantizer":{"result_t":"fixed<14,12,TRN,WRAP>"}}},"fusible":true},"registered_name":"FixedPointQuantizer","build_config":{"input_shape":[null,32]},"name":"dense_3_quantizer","inbound_nodes":[[["dense_3",0,0,{}]]]},{"module":"keras.layers","class_name":"Activation","config":{"name":"dense_3_relu","trainable":true,"dtype":"float32","activation":"relu"},"registered_name":null,"build_config":{"input_shape":[null,32]},"name":"dense_3_relu","inbound_nodes":[[["dense_3_quantizer",0,0,{}]]]},{"module":"hls4ml.utils.fixed_point_quantizer","class_name":"FixedPointQuantizer","config":{"name":"dense_3_relu_quantizer","trainable":false,"dtype":"float32","RND":"TRN","SAT":"WRAP","shape":[1,32],"overrides":{"layers":{"dense_3_relu":{"table_t":"ufixed<8,6,TRN,WRAP>","table_size":16384,"result_t":"ufixed<8,6,TRN,WRAP>"},"dense_3_relu_quantizer":{"result_t":"ufixed<8,6,TRN,WRAP>"}}},"fusible":false},"registered_name":"FixedPointQuantizer","build_config":{"input_shape":[null,32]},"name":"dense_3_relu_quantizer","inbound_nodes":[[["dense_3_relu",0,0,{}]]]},{"module":"keras.layers","class_name":"Dense","config":{"name":"dense_4","trainable":true,"dtype":"float32","units":5,"activation":"linear","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,32]},"name":"dense_4","inbound_nodes":[[["dense_3_relu_quantizer",0,0,{}]]]},{"module":"hls4ml.utils.fixed_point_quantizer","class_name":"FixedPointQuantizer","config":{"name":"dense_4_quantizer","trainable":false,"dtype":"float32","RND":"TRN","SAT":"WRAP","shape":[1,5],"overrides":{"layers":{"dense_4":{"_accum_multiplicity":32.0,"weight_t":"fixed<8,2>","accum_t":"fixed<13,5>","result_t":"fixed<11,5,TRN,WRAP>","bias_t":"fixed<13,5>"},"dense_4_quantizer":{"result_t":"fixed<11,5,TRN,WRAP>"}}},"fusible":false},"registered_name":"FixedPointQuantizer","build_config":{"input_shape":[null,5]},"name":"dense_4_quantizer","inbound_nodes":[[["dense_4",0,0,{}]]]}],"input_layers":[["input_1",0,0]],"output_layers":[["dense_4_quantizer",0,0]]},"keras_version":"2.13.1","backend":"tensorflow"}