{
  "class_name": "Functional",
  "config": {
    "name": "functional_5",
    "layers": [
      {
        "class_name": "InputLayer",
        "config": {
          "batch_input_shape": [
            null,
            784
          ],
          "dtype": "float32",
          "sparse": false,
          "ragged": false,
          "name": "input_3"
        },
        "name": "input_3",
        "inbound_nodes": []
      },
      {
        "class_name": "QActivation",
        "config": {
          "name": "q_activation_2",
          "trainable": true,
          "dtype": "float32",
          "activation": "quantized_relu(2)"
        },
        "name": "q_activation_2",
        "inbound_nodes": [
          [
            [
              "input_3",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "QDense",
        "config": {
          "name": "q_dense_2",
          "trainable": true,
          "dtype": "float32",
          "units": 20,
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "QInitializer",
            "config": {
              "initializer": {
                "class_name": "QInitializer",
                "config": {
                  "initializer": {
                    "class_name": "HeNormal",
                    "config": {
                      "seed": null
                    },
                    "__passive_serialization__": true
                  },
                  "use_scale": true,
                  "quantizer": {
                    "class_name": "quantized_po2",
                    "config": {
                      "bits": 4,
                      "max_value": 1,
                      "use_stochastic_rounding": false,
                      "quadratic_approximation": false
                    },
                    "__passive_serialization__": true
                  }
                },
                "__passive_serialization__": true
              },
              "use_scale": true,
              "quantizer": {
                "class_name": "quantized_po2",
                "config": {
                  "bits": 4,
                  "max_value": 1,
                  "use_stochastic_rounding": false,
                  "quadratic_approximation": false
                },
                "__passive_serialization__": true
              }
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": {
            "class_name": "Clip",
            "config": {
              "min_value": -1,
              "max_value": 1
            }
          },
          "bias_constraint": {
            "class_name": "Clip",
            "config": {
              "min_value": -1,
              "max_value": 1
            }
          },
          "kernel_quantizer": {
            "class_name": "quantized_po2",
            "config": {
              "bits": 4,
              "max_value": 1,
              "use_stochastic_rounding": false,
              "quadratic_approximation": false
            }
          },
          "bias_quantizer": {
            "class_name": "quantized_bits",
            "config": {
              "bits": 2,
              "integer": 0,
              "symmetric": 1,
              "alpha": null,
              "keep_negative": true,
              "use_stochastic_rounding": false
            }
          },
          "kernel_range": null,
          "bias_range": null
        },
        "name": "q_dense_2",
        "inbound_nodes": [
          [
            [
              "q_activation_2",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "QActivation",
        "config": {
          "name": "q_activation_3",
          "trainable": true,
          "dtype": "float32",
          "activation": "quantized_relu(3,1)"
        },
        "name": "q_activation_3",
        "inbound_nodes": [
          [
            [
              "q_dense_2",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "QDense",
        "config": {
          "name": "q_dense_3",
          "trainable": true,
          "dtype": "float32",
          "units": 10,
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "QInitializer",
            "config": {
              "initializer": {
                "class_name": "QInitializer",
                "config": {
                  "initializer": {
                    "class_name": "HeNormal",
                    "config": {
                      "seed": null
                    },
                    "__passive_serialization__": true
                  },
                  "use_scale": true,
                  "quantizer": {
                    "class_name": "quantized_bits",
                    "config": {
                      "bits": 4,
                      "integer": 0,
                      "symmetric": 1,
                      "alpha": 1,
                      "keep_negative": true,
                      "use_stochastic_rounding": false
                    },
                    "__passive_serialization__": true
                  }
                },
                "__passive_serialization__": true
              },
              "use_scale": true,
              "quantizer": {
                "class_name": "quantized_bits",
                "config": {
                  "bits": 4,
                  "integer": 0,
                  "symmetric": 1,
                  "alpha": 1,
                  "keep_negative": true,
                  "use_stochastic_rounding": false
                },
                "__passive_serialization__": true
              }
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": {
            "class_name": "Clip",
            "config": {
              "min_value": -1,
              "max_value": 1
            }
          },
          "bias_constraint": {
            "class_name": "Clip",
            "config": {
              "min_value": -1,
              "max_value": 1
            }
          },
          "kernel_quantizer": {
            "class_name": "quantized_bits",
            "config": {
              "bits": 4,
              "integer": 0,
              "symmetric": 1,
              "alpha": 1,
              "keep_negative": true,
              "use_stochastic_rounding": false
            }
          },
          "bias_quantizer": {
            "class_name": "quantized_bits",
            "config": {
              "bits": 4,
              "integer": 0,
              "symmetric": 1,
              "alpha": null,
              "keep_negative": true,
              "use_stochastic_rounding": false
            }
          },
          "kernel_range": null,
          "bias_range": null
        },
        "name": "q_dense_3",
        "inbound_nodes": [
          [
            [
              "q_activation_3",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Activation",
        "config": {
          "name": "activation_3",
          "trainable": true,
          "dtype": "float32",
          "activation": "softmax"
        },
        "name": "activation_3",
        "inbound_nodes": [
          [
            [
              "q_dense_3",
              0,
              0,
              {}
            ]
          ]
        ]
      }
    ],
    "input_layers": [
      [
        "input_3",
        0,
        0
      ]
    ],
    "output_layers": [
      [
        "activation_3",
        0,
        0
      ]
    ]
  },
  "keras_version": "2.4.0",
  "backend": "tensorflow"
}